function [y,t] = func1(A, t1, t2, t_step, t_max, t0)
%Функция, которая генерирует массив точек и строит график заданной функции
% A - амплитуда
% t1, t2 - время, входные аргументы
% y - выходной аргумент, откладывается по оси У
% t - выходной аргумент, откладывается по оси Х
% t0=-10 - начальное значение
% t_max=100 - максимальное значение
%t_step=1 - шаг
t=t0:t_step:t_max;
for i = length(t):-1:1 %Сначала присваивается максимальное значение, чтобы в цикле не менялся размер массива
    if t(i)<0
        y(i)=0;
    else 
        y=A*(exp(-t./t1) - exp(-t./t2));
    end
end
end

