function [ s ] = func1_filter( v,k,l,M )
% Трапецеидальный Фильтр для функции y=A*(exp(-t/t1)-exp(-t/t2)) 
% s - выходной параметр, который откладывается по оси Y
% k, l, M - входные параметры фильтра
% Формулы для расчета:
% d(n) = v(n) - v(n - K)- v(n - L)+ v(n - K - L);
% p(n) = p(n-1) + d(n);
% r(n) = p(n) + M*d(n);
% s(n) = s(n-1) + r(n);
% Число элементов в массиве:
n = numel(v); 
% создание массивов одной размерности для дальнейшей работы
[d,p,r,s] = deal(zeros(1,n)); 
% функция deal присваивает переменным d, p, r, s значения массива с числом n 
% функция zeros заполняет массив нулями
for i=1:n %вывод d(n), при разных k,l
    d(i) = v(i);
    if(i-k>= 1)
        d(i) = d(i) - v(i - k);
    end
    if(i-l >= 1)
        d(i) = d(i) - v(i - l);
    end
    if(i-l-k>= 1)
        d(i) = d(i) + v(i - l - k);
    end
end
% задание первых элементов
p(1) = d(1);
r(1) = p(1) + M*d(1);
s(1) = r(1);
for i=2:n
    p(i) = p(i-1) + d(i); % вывод p(n)
    r(i) = p(i) + M*d(i); % вывод r(n)
    s(i) = s(i-1) + r(i); % вывод s(n)
end
end

 