function [y,t] = func1(A, t1, t2, t_step, t_max, t0)
%‘ункци€, котора€ генерирует массив точек и строит график заданной функции
%   A - амплитуда
% t1, t2 - врем€, входные аргументы
% y - выходной аргумент, откладываетс€ по оси ”
% t - выходной аргумент, откладываетс€ по оси ’
% t0=-10 - начальное значение
% t_max=100 - максимальное значение
%t_step=1 - шаг
t=t0:t_step:t_max;
for i = length(t):-1:1 %сначала присваиваетс€ максимальное значение, чтобы в цикле не мен€лс€ размер массива
    if t(i)<0
        y(i)=0;
    else 
        y=A*(exp(-t./t1) - exp(-t./t2));
    end
end
end

