script
clc; clear; close all; format short;
%% Инициализация переменных
t = -10:100; % Временной вектор
A = 1; % Амплитудный множитель входного сигнала
tau1 = 16; % Постоянная времени 1 входного сигнала 
tau2 = 5; % Постоянная времени 2 входного сигнала 
k = 7; % Сдвиг 1 фильтра
l = 7; % Сдвиг 2 фильтра 
M = 16; % Множитель фильтра
%% Обращение к функциям
y = diff_of_exps(t, tau1, tau2, A); % Расчёт входного сигнала
s = resp_of_tri_filter(y, k, l, M); % Расчёт реакции фильтра
%% Построение графика 
yyaxis left
plot(t, y) % Входной сигнал
grid on; grid minor;
xlabel('t')
ylabel('y (t)')
yyaxis right
plot (t, s) % Выходной сигнал
ylabel('s(t)')

