%Построение графика из задания №1 пункта 1 при указанных входных данных

%Задание входных данных
t1 = 16;
t2 = 2;
t = -10:1:100; %Массив t. Значения: нач. - -10, шаг - 1, кон. - 100

k = 10;
l = 5;
M = 16;

%Запуск m-функции из файла "first_one"
y = first_one(t1,t2,t);

%Запуск m-функции из файла "first_three"
z = first_three(y,k,l,M);

%Вывод массива, сгенерированного в "first_one" виде графика
plot(t, y, 'r-x')
figure;
%Вывод графика трапецеидального фильтра из "first_three"
plot(t, z, 'b-x')