/*
	входные данные защелкиваются в регистры,
	а затем уже перемножаются.
	Поэтому на временной диаграмме выходные данные задерживаются на такт

	Подключен модуль D-триггера.
*/
module AB
(
	// Объявление входных сигналов
	input A,
	input B,
	input clk,
	// Объявление выходных сигналов
	output q
);

logic a,b; // регистры для хранения входных сигналов 
logic ab; // регистр хранения сигнала A*B

// защелкивание входных данных
d_trigger dtrigA(.d(A),.clk(clk),.out(a)); 
d_trigger dtrigB(.d(B),.clk(clk),.out(b));


always_ff @(posedge clk) // по переднему фронту clk выполни...
begin
	ab <= a * b;
end

assign q = ab; // выполняется всегда

endmodule