%% Функция экспоненты: Y = f_exp(t, t1, t2, A);
% t - массив чисел откладываемых по оси X.
% Y - выходной массив чисел откладываемых по оси Y.
% Расчет значений массива Y при t >= 0 выполняется по формуле: 
% Y(i) = A * ( exp(-t(i)/t1) - exp(-t(i)/t2) ).
% При t < 0 значение функции равно 0.
% Размерность Y совпадает с массивом t.
% t1, t2 — постоянные времени. (t1, t2 > 0)
% A — амплитуда сигнала. (A>0)
%% 
function massY = f_exp (t, t1, t2, A) 
    n = numel(t);
    massY = zeros(1,n);     
    for i=1:n
        if(t(i)>0)
            massY(i) = A * ( exp(-t(i)/t1) - exp(-t(i)/t2) );
        end
    end    
end