%Задаем трапецеидальный фильтр с заданными парамерами k,l,M
function  [s]=f_filter (v,k,l,M)   
%Заполняем массив переменных нулями
[d]=0;
[p]=0;
[r]=0;
[s]=0; 
%Определяем переменную d(n) от k и l
for  i=1:length(v) 
        d(i)=v(i);
    if(i-k>=1)
        d(i)=d(i)-v(i-k); 
    end
    if (i-l>=1)
        d(i)=d(i)-v(i-l);
    end
    if(i-l-k>=1)
        d(i)=d(i)+v(i-l-k);
    end
end
%Определяем первые элементы по уравнениям   
 p(1)=d(1);
 r(1)=p(1)+M*d(1);
 s(1)=r(1);
%Задаем остальные элементы        
for  i = 2:length(v)
        p(i) = p(i-1)+d(i);
        r(i) = p(i)+M*d(i);
        s(i) = s(i-1)+r(i);    
end
end